{
  "about": {
    "para1": "My passions lie in tinkering and playing with new tools, which led me to study Engineering at the University of Cambridge back in 2015. Since then, I've worked in various engineering roles but have naturally gravitated towards software and automation. My journey began with writing scripts to automate 3D design tasks and publishing iPhone applications in my free time.",
    "para2": "A year ago, I made the leap into web development. Since then, I've completed The Odin Project and ThreeJSJourney, and have pursued my own projects. This experience has solidified my love for creating and optimizing web applications, and I'm excited to continue exploring the vast world of full stack development."
  },

  "projects": [
    {
      "name": "Mosaic - Combine Albums With Stable Diffusion",
      "info": "A web app that combines albums found using Spotify API to generate a unique album cover through Stable Diffusion. Up to four albums can be selected along with how much influence they have as well as prompt. Token required to use app, click on the tag below.",
      "tags": ["React", "Sass", "JWT", "Node.js"],
      "img": "mosaic.png",
      "shader": "mosaic",
      "href": "https://mosaic.harris-ryder.com/",
      "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VybmFtZSI6ImhhcnJpc3J5ZGVyIiwiaWF0IjoxNzE5MzY1NDQ4LCJleHAiOjE3MTk0MDE0NDh9.i6S8Ura3cDy8CjHWRsPY9KfIcgBOgfiEASBZk4HbdiQ"
    },
    {
      "name": "Cathode Ray Tube Shader",
      "info": "A CRT shader to be used for web applications. All the logic written in the fragment shader, options to change pixel size, aspect ration and intensity.",
      "tags": ["Threejs", "webGL"],
      "img": "shader.png",
      "shader": "crtShader",
      "href": "https://shader-crt.harris-ryder.com/"
    },
    {
      "name": "Newspaper - Blog API",
      "info": "A web appplication to write and read articles, users can sign up and use the markdown editor to freely post their content. Articles are saved in a MongoDB database.",
      "tags": ["React", "Node.js", "MongoDB", "Passportjs"],
      "img": "newspaper.png",
      "shader": "newspaper",
      "href": "https://newspaper.harris-ryder.com/"
    },
    {
      "name": "Secret Club - Simple CRUD Application",
      "info": "A straightforward messaging application that enables users to register and participate in a global chat. Users with the correct password gain member and admin privileges, which include viewing message authors and deleting messages, respectively.",
      "tags": ["Javascript", "Node.js", "Passportjs", "MongoDB"],
      "img": "secretClub.png",
      "shader": "secretClub",
      "href": "https://members-only.harris-ryder.com/"
    },
    {
      "name": "VisualCV - Create a CV with proffesional Formatting",
      "info": "A CV formatter inspired by LaTex, left form receives users personal information and right side renders formatted pdf live.",
      "tags": ["React", "Tailwind CSS"],
      "img": "visualCV.png",
      "shader": "visualCV",
      "href": "https://cvmaker.harris-ryder.com/"
    },
    {
      "name": "Doge Rocket - iPhone Game",
      "info": "A flappy bird like game, steer a rocket with tricky mechanics through clouds. No longer on appstore as I stopped paying the Apple developer fee.",
      "tags": ["Swift", "SpriteKit"],
      "img": "dogeRocket.png",
      "shader": "doge",
      "href": "https://appadvice.com/app/doge2moon/1566547854"
    }
  ],

  "experience": [
    {
      "name": "Apiject",
      "info": "Apiject helps pharmaceutical companies deliver injectable medicines to more patients through the combination of fill, finish technologies and innovative design. Working in a division focused on future products run by the founder. Generating new concepts, with a focus on CAD design and prototyping.",
      "date": "2020 - 2023"
    },
    {
      "name": "Product Manager - Hawksley Medical Equipment",
      "info": "Began as a final year Master’s placement and was offered a permanent role. Took on the design of the company's new medical centrifuge, corresponding with manufacturers based in Korea & Germany.",
      "date": "2015 - 2019"
    },
    {
      "name": "Univeristy of Cambridge - Master's Engineering",
      "info": "BA (Hons), MEng: Manufacturing Engineering Tripos (2.1, Merit)",
      "date": "2015 - 2019"
    }
  ]
}
